Revit 2024 API
InternalOrigin Class
 A class representing the origin of internal coordinate system. Each Revit project contains one InternalOrigin.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020.2
Syntax
C#
public class InternalOrigin : Element
Visual Basic
Public Class InternalOrigin _
	Inherits Element
Visual C++
public ref class InternalOrigin : public Element
Remarks
 The internal origin cannot be selected (e.g. as a reference) nor can it be modified.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.InternalOrigin
See Also
InternalOrigin Members
Autodesk.Revit.DB Namespace